application/models/CRM-PIPELINE-STAGE.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:adin="http://3e.pl/ADInterface">
   <soapenv:Header/>
   <soapenv:Body>
      <adin:updateData>
         <adin:ModelCRUDRequest>
            <adin:ModelCRUD>
               <adin:serviceType>API-PIPELINE-STAGE</adin:serviceType>
               <adin:RecordID>[XX_Pipeline_ID]</adin:RecordID>
               <adin:DataRow>
               	<adin:field column="XX_PipelineStage_ID">
               	    <adin:val>[XX_PipelineStage_ID]</adin:val>
               	</adin:field>
                <adin:field column="Reference">
                    <adin:val>WEB</adin:val>
                </adin:field>
               </adin:DataRow>
            </adin:ModelCRUD>
            <adin:ADLoginRequest>
               <adin:user>[user]</adin:user>
               <adin:pass>[pass]</adin:pass>
               <adin:lang>192</adin:lang>
               <adin:ClientID>[adclient]</adin:ClientID>
               <adin:RoleID>[roleid]</adin:RoleID>
               <adin:OrgID>[orgid]</adin:OrgID>
               <adin:WarehouseID>[whid]</adin:WarehouseID>
            </adin:ADLoginRequest>
         </adin:ModelCRUDRequest>
      </adin:updateData>
   </soapenv:Body>
</soapenv:Envelope>